import { FC } from 'react'
'use client';
import {
    FaAngleLeft,
    FaBookmark,
    FaBarsStaggered,
    FaLink,
    FaEye,
    FaHashtag
} from 'react-icons/fa6'
import { Accordion, Navbar, Flowbite, DarkThemeToggle } from 'flowbite-react';
import { BottomNavigation } from './bottomNavigation';
import { Link } from 'react-router-dom';

export const Learning12: FC = () => {
    return (
        <div className="lg:grid lg:grid-cols-11 lg:gap-2 w-full h-full mx-auto fade-In">
            <div className='col-start-4 col-span-5 h-full '>
                <Navbar fluid className='sticky top-0 z-40 slide-down'>
                    <Navbar.Brand >
                        <Link to={"/learning"} >
                            <div className=' ml-1 bg-gray-100 dark:bg-gray-700 p-2 rounded-lg '>
                                <FaAngleLeft className=' w-6 h-6   text-gray-500 dark:text-gray-400 group-hover:text-blue-600 dark:group-hover:text-blue-500' />
                            </div>
                        </Link>
                    </Navbar.Brand>
                    <div className="flex md:order-2 items-center">
                        <FaBookmark className=' w-4 h-4  me-3 text-gray-500 dark:text-gray-400 group-hover:text-blue-600 dark:group-hover:text-blue-500' />
                        <Flowbite>
                            <DarkThemeToggle className='focus:ring-0 ' />
                        </Flowbite>
                        <Link to={"/user"}>
                            <FaBarsStaggered className="mr-3 ml-3 w-5 h-5  text-gray-500 dark:text-gray-400 group-hover:text-blue-600 dark:group-hover:text-blue-500" />
                        </Link>
                    </div>
                </Navbar>
                <div className='flex justify-center'>
                    <div>
                        <div className='h-full w-full p-3 mb-16'>
                            <div className='relative'>
                                <img src={"https://i.imgur.com/hvQrohA.gif"} alt="img 2" className='h-72 wrap-img absolute rounded-t-lg w-full object-cover ' />
                                <img src={"https://i.imgur.com/jL3cxSo.gif"} alt="img 1" className='h-72  rounded-t-lg w-full object-cover object-top ' />
                            </div>
                            <div className='w-full border border-drak-400  dark:border-slate-700 p-3 flex justify-center gap-4 mt-1'>
                                <div><FaBookmark className='inline-flex w-4 h-4  me-1 text-gray-500 dark:text-gray-400 ' /><span className='text-xs font-semibold text-gray-500 dark:text-gray-400 '>0</span></div>
                                <div><FaEye className='inline-flex w-4 h-4  me-1 text-gray-500 dark:text-gray-400 ' /><span className='text-xs font-semibold text-gray-500 dark:text-gray-400 '>2</span></div>
                                <div><FaHashtag className='inline-flex w-3 h-3  me-1 text-gray-500 dark:text-gray-400 ' /><span className='text-xs font-semibold text-gray-500 dark:text-gray-400 '>การเรียนรู้</span></div>
                            </div>
                            <Accordion className='!rounded-none mt-1' collapseAll>
                                <Accordion.Panel>
                                    <Accordion.Title className='font-semibold'>นวัตกรรม?</Accordion.Title>
                                    <Accordion.Content>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            นวัตกรรม  เป็นวิธีการปฏิบัติใหม่ที่แปลกไปจากเดิม โดยอาจจะได้มาจากการคิดค้น หรือการปรับปรุงเสริมแต่งของเก่า และสิ่งเหล่านี้ได้รับการทดลองและพัฒนาจนเป็นที่เชื่อถือได้ ทำให้ระบบบรรลุจุดมุ่งหมายได้อย่างมีประสิทธิภาพ
                                        </p>
                                    </Accordion.Content>
                                </Accordion.Panel>
                                <Accordion.Panel>
                                    <Accordion.Title className='font-semibold'>เทคโนโลยีสารสนเทศ?</Accordion.Title>
                                    <Accordion.Content>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            ความก้าวหน้าทางด้านวิทยาศาสตร์และเทคโนโลยี ทำให้มีการพัฒนาคิดค้นสิ่งอำนวยความสะดวกสบายต่อการดำชีวิตเป็นอันมาก เทคโนโลยีได้เข้ามาเสริมปัจจัยพื้นฐานการดำรงชีวิตได้เป็นอย่างดี เทคโนโลยีทำให้การสร้างที่พักอาศัยมีคุณภาพมาตรฐาน สามารถผลิตสินค้าและให้บริการต่าง ๆ เพื่อตอบสนองความต้องการของมนุษย์มากขึ้น เทคโนโลยีทำให้ระบบการผลิตสามารถผลิตสินค้าได้เป็นจำนวนมากมีราคาถูกลง สินค้าได้คุณภาพ เทคโนโลยีทำให้มีการติดต่อสื่อสารกันได้สะดวก การเดินทางเชื่อมโยงถึงกันทำให้ประชากรในโลกติดต่อรับฟังข่าวสารกันได้ตลอดเวลา
                                        </p>

                                    </Accordion.Content>
                                </Accordion.Panel>
                                <Accordion.Panel>
                                    <Accordion.Title className='font-semibold'>ความก้าวหน้าของเทคโนโลยีสารสนเทศ</Accordion.Title>
                                    <Accordion.Content>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            ในภาวะสังคมปัจจุบัน หลายสิ่งหลายอย่างที่เกิดขึ้นรอบตัวเป็นตัวชี้บอกว่า ประเทศไทยกำลังก้าวสู่ยุคสารสนเทศ ดังจะเห็นได้จากวงการศึกษาสนใจให้ความรู้ด้านคอมพิวเตอร์และส่งเสริมการนำเทคโนโลยีคอมพิวเตอร์มาประยุกต์งานต่างๆ มากขึ้น การบริหารธุรกิจของบริษัทห้างร้านต่างๆ ทั้งในระดับใหญ่และระดับกลาง ตลอดจนหน่วยงานของรัฐบาลและรัฐวิสาหกิจมีการพัฒนาระบบสารสนเทศเพื่อใช้ในองค์การด้วยการเก็บข้อมูล ประมวลผลและวิเคราะห์ข้อมูล แล้วนำผลลัพธ์มาช่วยในการวางแผนและตัดสินใจ

                                            ระยะเริ่มแรกที่มนุษย์ได้คิดค้นประดิษฐ์คอมพิวเตอร์ที่มีลักษณะเป็นเครื่องคำนวณอิเล็กทรอนิกส์ คอมพิวเตอร์ได้ถูกใช้ทำงานด้านการคำนวณทางวิทยาศาสตร์เป็นส่วนใหญ่แล้วจึงนำมาใช้เก็บรวบรวมและประมวลผลข้อมูลทางด้านธุรกิจในเวลาต่อมา ยุคแรกนี้เรียกว่ายุคการประมวลผลข้อมูล (data processing age)

                                            ข้อมูลที่ได้มาควรจะต้องทำการประมวลผลให้ได้เป็นสารสนเทศก่อน จึงจะนำไปใช้ให้เกิดประโยชน์ วิธีการประมวลผลข้อมูลจะเริ่มตั้งแต่การรวบรวมจัดเก็บข้อมูล เมื่อได้ข้อมูลแล้วต้องทำการตรวจสอบความถูกต้อง แบ่งกลุ่มจัดประเภทของข้อมูล เช่น ข้อมูลตัวอักษรซึ่งเป็นชื่อหรือข้อความก็อาจต้องมีการเรียงลำดับ และข้อมูลตัวเลขก็อาจต้องมีการคำนวณ จากนั้นจึงทำสรุปได้เป็นสารสนเทศออกมา

                                            ถ้าข้อมูลที่นำมาประมวลผลมีจำนวนมากจนเกินความสามารถของมนุษย์ที่จะทำได้ในเวลาอันสั้น ก็จำเป็นจะต้องนำเครื่องคอมพิวเตอร์มาช่วยเก็บข้อมูล และประมวลผลข้อมูล เมื่อข้อมูลอยู่ภายในคอมพิวเตอร์ การแก้ไขหรือเรียกค้นสามารถทำได้ง่ายและสะดวก ขณะเดียวกันการทำสำเนาและการแจกจ่ายข้อมูล ก็สามารถดำเนินการได้ทันที

                                            งานที่เกิดขึ้นจากการประมวลผลข้อมูลมักจะเก็บในลักษณะแฟ้มข้อมูล ตัวอย่างเช่น การทำบัญชีเงินเดือนของพนักงานในบริษัท ข้อมูลเงินเดือนของพนักงานที่เก็บในคอมพิวเตอร์จะรวมกันเป็นแฟ้มข้อมูลที่ประกอบด้วยชื่อพนักงาน เงินเดือน และข้อมูลสำคัญอื่น โปรแกรมคอมพิวเตอร์จะเรียกแฟ้มเงินเดือนมาประมวลผลและสรุปผลรวมยอดขั้นตอนการทำงานจะต้องทำพร้อมกันทีเดียวทั้งแฟ้มข้อมูล ที่เรียกว่า การประมวลผลแบบกลุ่ม (batch processing)

                                            แต่เนื่องจากระบบงานที่เกิดขึ้นภายในองค์การค่อนข้างจะซับซ้อน เช่น รายได้ของพนักงานที่ได้รับในแต่ละเดือน อาจไม่ได้มาจากอัตราเงินเดือนประจำเท่านั้น แต่จะมีมาจากค่านายหน้าจากการขายสินค้าด้วย ในลักษณะนี้แฟ้มข้อมูลการขาย จะสัมพันธ์กับแฟ้มข้อมูลเงินเดือน และสัมพันธ์กับแฟ้มข้อมูลอื่น ๆ เช่น ค่าสวัสดิการ การหักเงินเดือนเป็นค่าใช้จ่ายต่าง ๆ เช่น ค่าน้ำ ค่าไฟฟ้า เป็นต้น ระบบข้อมูลจะกลายมาเป็นระบบที่มีแฟ้มข้อมูลหลายแฟ้มมาเชื่อมสัมพันธ์กัน และโปรแกรมคอมพิวเตอร์ที่จะเรียกแฟ้มข้อมูลเหล่านั้นมาจัดการให้เป็นไปตามชิ้นงานที่ต้องการก็ยิ่งยากและซับซ้อนมากขึ้น ระบบข้อมูลนี้จะเรียกว่า ระบบฐานข้อมูล (database)

                                            การจัดการข้อมูลที่เป็นฐานข้อมูล จะเป็นระบบสารสนเทศที่มีประโยชน์ซึ่งจะนำไปช่วยงานด้านต่าง ๆ อย่างได้ผล ระบบข้อมูลที่สร้างเพื่อใช้ในบริษัทจะเป็นระบบฐานข้อมูลของกิจกรรมที่เกิดขึ้น เพื่อแสดงสารสนเทศที่เป็นจริงของบริษัท สามารถนำข้อเท็จจริงนั้นไปวิเคราะห์และนำผลลัพธ์ไปประกอบการตัดสินใจของผู้บริหาร เพื่อการวางแผนและกำหนดนโยบายการจัดการต่าง ๆ

                                            ในปัจจุบันการนำคอมพิวเตอร์ไปใช้งานของประเทศต่าง ๆ ทั่วโลก จะอยู่ที่การใช้สารสนเทศเป็นส่วนใหญ่ แนวโน้มของระบบจัดการข้อมูลของยุคนี้ จะเริ่มเปลี่ยนจากระบบงานการประมวลผลแบบกลุ่มมาเป็นระบบตอบสนองทันที ที่เรียกว่า การประมวลผลแบบเชื่อมตรง (online processing) ซึ่งเราคงจะได้ยินได้ฟังการโฆษณาประชาสัมพันธ์การฝากถอนเงินของธนาคารต่าง ๆ มาแล้ว

                                            ขณะที่ประเทศต่าง ๆ ยังอยู่ในยุคของการประมวลผลสารสนเทศ ประเทศบางประเทศ เช่น สหรัฐอเมริกา และญี่ปุ่น ก็ได้พยายามก้าวเดินไปสู่การประมวลฐานความรู้ (knowledge base processing) โดยให้คอมพิวเตอร์ใช้ง่าย รู้จักตอบสนองกับผู้ใช้ และสามารถแก้ปัญหาที่ต้องอาศัยการตัดสินใจระดับสูง ด้วยการเก็บสะสมฐานความรู้ไว้ในคอมพิวเตอร์ และมีโครงสร้างการให้เหตุผล เพื่อนำความรู้มาช่วยแก้ปัญหาที่สลับซับซ้อน

                                            ยุคของการประมวลฐานความรู้เป็นการประยุกต์ใช้หลักวิชาด้านปัญญาประดิษฐ์ (Artificial Intelligence : AI) ที่รวบรวมศาสตร์หลายแขนง คือ คอมพิวเตอร์ จิตวิทยา ปรัชญา และภาษาศาตร์เข้าด้วยกัน ตัวอย่างชิ้นงานของยุคนี้ได้แก่ หุ่นยนต์ และระบบผู้เชี่ยวชาญ (expert system) ปัจจุบันมีซอฟต์แวร์ที่เป็นระบบผู้เชี่ยวชาญมาช่วยในการวินิจฉัยโรคต่าง ๆ การสำรวจทรัพยากรธรรมชาติ และการอนุมัติให้กู้ยืมเงินเพื่อทำโครงการของธนาคาร เป็นต้น
                                        </p>

                                    </Accordion.Content>
                                </Accordion.Panel>
                                <Accordion.Panel>
                                    <Accordion.Title className='font-semibold'>นวัตกรรมและเทคโนโลยีสารสนเทศสมัยใหม่แบบระบบธุระกิจ?</Accordion.Title>
                                    <Accordion.Content>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            ปัจจุบันนวัตกรรมและเทคโนโลยีสารสนเทศสมัยใหม่ได้บูรณาการเข้าสู่ระบบธุรกิจ ดังนั้นองค์การที่จะอยู่รอดและมีพัฒนาการต้องสามารถปรับตัวและจัดการกับเทคโนโลยีอย่างเหมาะสม ซึ่งเทคโนโลยีสารสนเทศมีผลต่อการดำเนินธุรกิจในอนาคต เพื่อให้ผู้บริหารในฐานะหัวใจสำคัญของการพัฒนาเทคโนโลยีสารสนเทศขององค์การได้ศึกษา แต่เนื่องจากการเปลี่ยนแปลงอย่างรวดเร็วของเทคโนโลยีสารสนเทศอาจทำให้เทคโนโลยีที่กล่าวถึงในที่นี้ล้าสมัยได้ในระยะเวลาอันรวดเร็ว ดังนั้นจึงมีความจำเป็นที่ผู้บริหารที่สนใจจะต้องศึกษาติดตามความเปลี่ยนแปลงอยู่ตลอดเวลา โดยเทคโนโลยีสารสนเทศที่สำคัญในอนาคตมีดังต่อไปนี้
                                        </p>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            1.คอมพิวเตอร์ (Computer)
                                            ปัจจุบันคอมพิวเตอร์ได้พัฒนาไปจากยุคแรกที่เครื่องมีขนาดใหญ่ทำงานได้ช้า ความสามารถต่ำ และใช้พลังงานสูง เป็นการใช้เทคโนโลยีวงจรรวมขนาดใหญ่ (very large scale integrated circuit : VLSI) ในการผลิตไมโครโปรเซสเซอร์ (microprocessor) ทำให้ประสิทธิภาพของส่วนประมวลผลของเครื่องพัฒนาขึ้นอย่างเห็นได้ชัด นอกจากนี้ยังได้มีการพัฒนาหน่วยความจำให้มี ประสิทธิภาพสูงขึ้น แต่มีราคาถูกลง ซึ่งช่วยเพิ่มศักยภาพในการทำงานของคอมพิวเตอร์ส่วนบุคคลในปัจจุบัน โดยที่คอมพิวเตอร์ส่วนบุคคลในขณะที่มีความสามารถเท่าเทียมหรือมากกว่าเครื่องคอมพิวเตอร์ขนาดใหญ่ในสมัยก่อน ตลอดจนการนำคอมพิวเตอร์ชนิดลดชุดคำสั่ง (reduced instruction set computer)หรือ RISC มาใช้ในการออกแบบหน่วยประเมินผล ทำให้เครื่องคอมพิวเตอร์สามารถทำงานได้เร็วขึ้นโดยใช้คำสั่งพื้นฐานง่าย ๆ นอกจากนี้พัฒนาการและการประยุกต์ความรู้ในสาขาวิชาต่าง ๆ ทั้งสาขาวิทยาศาสตร์ วิศวกรรมศาสตร์ และเทคโนโลยีสารสนเทศ ที่ส่งผลให้เครื่องคอมพิวเตอร์มีการประมวลผลตามหลักเหตุผลของมนุษย์หรือระบบปัญญาประดิษฐ์ ซึ่งจะกล่าวถึงในหัวข้อต่อไป
                                        </p>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            2.ปัญญาประดิษฐ์(artificial intelligence) หรือ AI
                                            เป็นการพัฒนาระบบคอมพิวเตอร์ให้มีความสามารถที่จะคิดแก้ปัญหาและให้เหตุผลได้เหมือนอย่างการใช้ภูมิปัญญาของมนุษย์จริง ปัจจุบันนักวิทยาศาสตร์ในหลายสาขาวิชาได้ศึกษาและทดลองที่จะพัฒนาระบบคอมพิวเตอร์ให้สามารถทำงานที่มีเหตุผล โดยการเลียนแบบการทำงานของสมองมนุษย์ ซึ่งความรู้ทางด้านนี้ถ้าได้รับการพัฒนาอย่างต่อเนื่องจะสามารถนำมาประยุกต์ใช้งานต่าง ๆ อย่างมากมาย เช่น ระบบผู้เชี่ยวชาญเป็นระบบคอมพิวเตอร์ที่ถูกพัฒนาขึ้นเพื่อให้ความสามารถในการแก้ปัญหาได้อย่างผู้เชี่ยวชาญ และหุ่นยนต์ (Robotics)  เป็นการพัฒนาสิ่งประดิษฐ์ให้สามารถปฏิบัติงานและใช้ทักษะการเคลื่อนไหวได้ใกล้เคียงกับการทำงานของมนุษย์เป็นต้น
                                        </p>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            3.ระบบสารสนเทศสำหรับผู้บริหาร (executive information system)หรือ EIS
                                            เป็นการพัฒนาระบบสารสนเทศที่สนับสนุนผู้บริหารในงานระดับวางแผนนโยบายและกลยุทธ์ขององค์การโดยที่ EIS จะถูกนำมาให้คำแนะนำผู้บริหารในการตัดสินใจเมื่อประสบปัญหาแบบไม่มีโครงสร้างหรือกึ่งโครงสร้าง โดย EISเป็นระบบที่พัฒนาขึ้นเพื่อตอบสนองความต้องการที่พิเศษของผู้บริหารในด้านต่าง ๆ เช่น สถานการณ์ต่าง ๆ ทั้งภายในและภายนอกองค์การ รวมทั้งสถานะของคู่แข่งขันด้วย โดยที่ระบบจะต้องมีความละเอียดอ่อนตลอดจนง่ายต่อการใช้งาน เนื่องจากผู้บริหารระดับสูงจำนวนมากไม่เคยชินกับการติดต่อและสั่งงานโดยตรงกับระบบคอมพิวเตอร์
                                        </p>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            4.การจดจำเสียง (voice recognition)
                                            เป็นความพยายามของนักวิทยาศาสตร์ที่จะทำให้คอมพิวเตอร์จดจำเสียงของผู้ใช้ ปัจจุบันการพัฒนาเทคโนโลยีสาขานี้ยังไม่ประสบความสำเร็จตามที่นักวิทยาศาสตร์ต้องการ ถ้าในอนาคตนักวิทยาศาสตร์ประสบความสำเร็จในการนำความรู้ต่าง ๆ มาใช้สร้างระบบการจดจำเสียง ก็จะสามารถสร้างประโยชน์ได้อย่างมหาศาลแก่การใช้งานคอมพิวเตอร์และเทคโนโลยีสารสนเทศ โดยที่ผู้ใช้จะสามารถออกคำสั่งและตอบโต้กับคอมพิวเตอร์แทนการกดแป้นพิมพ์ ซึ่งจะส่งผลให้ผู้ที่ไม่เคยชินกับการใช้คอมพิวเตอร์ให้สามารถปรับตัวเข้ากับระบบได้ง่าย เช่น ระบบสารสนเทศสำหรับผู้บริหารระดับสูง การสั่งงานระบบฐานข้อมูลต่าง ๆ และระบบรักษาความปลอดภัยของข้อมูล เป็นต้น ซึ่งจะช่วยเพิ่มประสิทธิภาพในการทำงานและขยายคุณค่าเพิ่มของเทคโนโลยีสารสนเทศที่มีต่อธุรกิจ
                                        </p>
                                        <p className="mb-2 text-gray-500  dark:text-gray-400">
                                            5.การแลกเปลี่ยนข้อมูลอิเล็กทรอนิกส์ (electronics data interchange)หรือ EDI
                                            เป็นการส่งข้อมูลหรือข่าวสารจากระบบคอมพิวเตอร์หนึ่งไปสู่ระบบคอมพิวเตอร์อื่นโดยผ่านทางระบบสื่อสารข้อมูลอิเล็กทรอนิกส์ เช่น การส่งคำสั่งซื้อจากผู้ซื้อไปยังผู้ขายโดยตรง ปัจจุบันระบบแลกเปลี่ยนข้อมูลอิเล็กทรอนิกส์กำลังได้รับความนิยมเพิ่มมากขึ้นเรื่อย ๆ เพราะช่วงลดระยะเวลาในการทำงานของแต่ละองค์การลง โดยองค์การจะสามารถส่งและรับสารสนเทศในการดำเนินธุรกิจ เช่น ใบสั่งซื้อและใบตอบรับผ่านระบบสื่อสารโทรคมนาคมที่มีอยู่ ทำให้ทั้งผู้ส่งและผู้รับไม่ต้องเสียเวลาเดินทาง
                                        </p>

                                    </Accordion.Content>
                                </Accordion.Panel>
                                <Accordion.Panel>
                                    <Accordion.Title className='font-semibold'>แหล่งที่มาของข้อมูล</Accordion.Title>
                                    <Accordion.Content>
                                        <div className="mb-2 text-gray-500 dark:text-gray-400">
                                            <a className='underline block' href="https://banthitablog.wordpress.com/%E0%B8%99%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%84%E0%B9%82%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%A2%E0%B8%B5%E0%B8%AA%E0%B8%B2/"><FaLink className='me-1 inline-flex' /> BANTHITABLOG</a>
                                        </div>

                                    </Accordion.Content>
                                </Accordion.Panel>

                            </Accordion>
                        </div >
                    </div >

                </div >
                <BottomNavigation />
            </div >
        </div >
    )
}

